from random import *


n = int(input("Введите размерность массива: "))
print()
print("-----------------------------------------------------------------")
a = [randint(1, 100) for i in range(n)]
print("Массив:", a)

c3 = 0
c2 = 0
s2 = 0
sred = 0
for i in range(n):
    if a[i] % 3 == 0:
        c3 += 1
    if a[i] % 2 == 0:
        s2 += a[i]
        c2 += 1
        sred = s2 / c2

a = [c3] + a + [sred]
print("Полученный массив:", a)
print("-----------------------------------------------------------------")


