a = []
s1 = 0
p2 = 1
c1 = 0
c2 = 0
while True:
    n = int(input("Введите число: "))
    if n == 55555:
        break
    index = c1 + c2 + 1
    if index % 2 != 0:
        s1 += n
        c1 += 1
    else:
        p2 *= n
        c2 += 1
print()
print("-----------------------------------------------------------------")
print("Сумма чисел с нечётными номерами:", s1)
print("Произведение чисел с чётными номерами:", p2)
print("Количество слагаемых:", c1)
print("Количество сомножителей:", c2)
print("-----------------------------------------------------------------")